namespace Model.Rules
{
  /// <summary>
  /// Класс, представляющий правила игры и управление для пользователя.
  /// </summary>
  public class ModelRules
  {
    /// <summary>
    /// Массив строк, содержащий описание правил игры.
    /// </summary>
    public string[] RulesText { get; set; }

    /// <summary>
    /// Массив строк, содержащий описание элементов управления игрой.
    /// </summary>
    public string[] ControlsText { get; set; }

    /// <summary>
    /// Инициализирует новый экземпляр класса <see cref="ModelRules"/>, задавая стандартные правила и элементы управления.
    /// </summary>
    public ModelRules()
    {
      // Инициализация правил игры
      RulesText =
      [
        "Правила игры \"Охотник за сокровищами\":",
        "1. Игрок управляет персонажем, собирающим монеты и артефакты, падающие с неба.",
        "2. Основная цель — достичь целей по количеству собранных монет и очков.",
        "3. Метеорит уменьшает количество очков на 10.",
        "4. Воришка удалит все хорошие объекты с игрового поля.",
        "5. Золотая монета - 4 очка, серебряная - 2, бронзовая - 1.",
        "6. Таймер добавляет 10 секунд на прохождение уровня.",
        "7. Магнит притягивает монетки.",
        "8. X2 умножает текущее количество очков на 2.",
        "9. Игра завершается, если время истекло."
      ];

      // Инициализация управления игрой
      ControlsText =
      [
        "ПРОБЕЛ - пауза",
        "ESC - Главное меню",
        "Стрелка влево - игрок движется влево",
        "Стрелка вправо - игрок движется вправо"
      ];
    }
  }
}
