namespace Model.Rules
{
  public class ModelRules
  {
    // Массив строк для правил
    public string[] RulesText { get; set; }

    // Массив строк для управления
    public string[] ControlsText { get; set; }

    public ModelRules()
    {
      RulesText = new string[]
      {
        "Правила игры \"Охотник за сокровищами\":",
        "1. Игрок управляет персонажем, собирающим монеты и артефакты, падающие с неба.",
        "2. Основная цель — достичь целей по количеству собранных монет и очков.",
        "3. Метеорит уменьшает количество очков на 10.",
        "4. Воришка удалит все хорошие объекты с игрового поля.",
        "5. Золотая монета - 4 очка, серебряная - 2, бронзовая - 1.",
        "6. Таймер добавляет 10 секунд на прохождение уровня.",
        "7. Магнит притягивает монетки.",
        "8. X2 умножает текущее кол-во очков на 2.",
        "9. Игра завершается, если время истекло."
      };

      ControlsText = new string[]
      {
        "ПРОБЕЛ - пауза",
        "ESC - Главное меню",
        "Стрелка влево - игрок движется влево",
        "Стрелка вправо - игрок движется вправо"
      };
    }
  }
}
